##### Consider following code to answer further questions:                                                                                                                                      Q1. Write a code to print the data present in the second row of the dataframe, df.

In [12]:
#### Answer:

import pandas as pd
course_name = ['Data Science', 'Machine Learning' , 'Big Data', 'Data Engineer']
duration = [2,3,6,4]
df = pd.DataFrame(data = {'course_name' : course_name, 'duration' : duration})
df

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

In [13]:
df.columns

Index(['course_name', 'duration'], dtype='object')

In [14]:
df[['course_name', 'duration']][1:2]

        course_name  duration
1  Machine Learning         3

In [15]:
df.iloc[1]

course_name    Machine Learning
duration                      3
Name: 1, dtype: object

##### Q2. What is the difference between the functions loc and iloc in pandas.DataFrame?

#Answer :
The main distinction between loc and iloc is:

loc is label-based, which means that you have to specify rows and columns based on their row and column labels.
iloc is integer position-based, so you have to specify rows and columns by their integer position values (0-based integer position).

##### Q3. Reindex the given dataframe using a variable, reindex = [3,0,1,2] and store it in the variable, new_df.  then find the output for both new_df.loc[2] and new_df.iloc[2].Did you observe any difference in both the outputs? If so then explain it. Consider the below code to answer further questions:

In [16]:
# Answer : 
import pandas as pd
import numpy as np
columns = ['column_1', 'column_2', 'column_3', 'column_4', 'column_5', 'column_6']
indices = [1,2,3,4,5,6]
#Creating a dataframe:
df1 = pd.DataFrame(np.random.rand(6,6), columns = columns, index = indices)

In [17]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.015934  0.172646  0.794025  0.327293  0.865715  0.914259
2  0.158388  0.966158  0.959607  0.795396  0.910615  0.892618
3  0.964759  0.930963  0.505589  0.558094  0.870704  0.989660
4  0.491016  0.683230  0.828330  0.084074  0.031050  0.529586
5  0.492089  0.893611  0.571597  0.974798  0.233869  0.074810
6  0.220535  0.897990  0.428519  0.728878  0.224427  0.482940

In [18]:
df1.loc[2]

column_1    0.158388
column_2    0.966158
column_3    0.959607
column_4    0.795396
column_5    0.910615
column_6    0.892618
Name: 2, dtype: float64

In [19]:
df1.iloc[2]

column_1    0.964759
column_2    0.930963
column_3    0.505589
column_4    0.558094
column_5    0.870704
column_6    0.989660
Name: 3, dtype: float64

In [20]:
new_df = df1.reindex([3,0,1,2])

In [21]:
new_df

   column_1  column_2  column_3  column_4  column_5  column_6
3  0.964759  0.930963  0.505589  0.558094  0.870704  0.989660
0       NaN       NaN       NaN       NaN       NaN       NaN
1  0.015934  0.172646  0.794025  0.327293  0.865715  0.914259
2  0.158388  0.966158  0.959607  0.795396  0.910615  0.892618

In [22]:
new_df.iloc[2]

column_1    0.015934
column_2    0.172646
column_3    0.794025
column_4    0.327293
column_5    0.865715
column_6    0.914259
Name: 1, dtype: float64

In [23]:
new_df.loc[2]
# we observed that by swapping the postion of the index column has been changed.

column_1    0.158388
column_2    0.966158
column_3    0.959607
column_4    0.795396
column_5    0.910615
column_6    0.892618
Name: 2, dtype: float64

##### Q4. Write a code to find the following statistical measurements for the above dataframe df1:
(i) mean of each and every column present in the dataframe.
(ii) standard deviation of column, ‘column_2’

In [24]:
df1.columns

Index(['column_1', 'column_2', 'column_3', 'column_4', 'column_5', 'column_6'], dtype='object')

In [25]:
df1[['column_1', 'column_2', 'column_3', 'column_4', 'column_5', 'column_6']].mean()

column_1    0.390454
column_2    0.757433
column_3    0.681278
column_4    0.578089
column_5    0.522730
column_6    0.647312
dtype: float64

In [26]:
df1[['column_1', 'column_2', 'column_3', 'column_4', 'column_5', 'column_6']].std()

column_1    0.338603
column_2    0.303137
column_3    0.209087
column_4    0.327013
column_5    0.400838
column_6    0.351361
dtype: float64

In [27]:
df1.iloc[::].mean()

column_1    0.390454
column_2    0.757433
column_3    0.681278
column_4    0.578089
column_5    0.522730
column_6    0.647312
dtype: float64

In [28]:
df1.iloc[::].std()

column_1    0.338603
column_2    0.303137
column_3    0.209087
column_4    0.327013
column_5    0.400838
column_6    0.351361
dtype: float64

##### Q5. Replace the data present in the second row of column, ‘column_2’ by a string variable then find the mean of column, column_2.  If you are getting errors in executing it then explain why.[Hint: To replace the data use df1.loc[] and equate this to string data of your choice.]

In [29]:
df1.iloc[:,1] = ['a' , 'b', 'c' , 'd' , 'e' , 'f']

In [30]:
df1

   column_1 column_2  column_3  column_4  column_5  column_6
1  0.015934        a  0.794025  0.327293  0.865715  0.914259
2  0.158388        b  0.959607  0.795396  0.910615  0.892618
3  0.964759        c  0.505589  0.558094  0.870704  0.989660
4  0.491016        d  0.828330  0.084074  0.031050  0.529586
5  0.492089        e  0.571597  0.974798  0.233869  0.074810
6  0.220535        f  0.428519  0.728878  0.224427  0.482940

In [31]:
# df1.iloc[:,1].mean()
# since the data type is string so mean cann't be determined.

##### Q6. What do you understand about the windows function in pandas and list the types of windows functions?

Answer : Windows function in Pandas can be broadly divided into three categories namely- Aggregate, Ranking, and Value. The group by aggregate function can be used to partition and group the entire data frame by some column. We can specify the column name in the parameter of the pandas.

##### Q7. Write a code to print only the current month and year at the time of answering this question   
[Hint: Use pandas.datetime function]

In [32]:
# Answer :
data = pd.date_range(start = '2023-01-01' ,end = '2023-12-31')

In [33]:
df_date = pd.DataFrame({"date" : data})

In [34]:
df3 = df_date

In [35]:
df3

          date
0   2023-01-01
1   2023-01-02
2   2023-01-03
3   2023-01-04
4   2023-01-05
..         ...
360 2023-12-27
361 2023-12-28
362 2023-12-29
363 2023-12-30
364 2023-12-31

[365 rows x 1 columns]

In [36]:
df3['month'] = df3['date'].dt.month
df3['year'] = df3['date'].dt.year

In [37]:
df3

          date  month  year
0   2023-01-01      1  2023
1   2023-01-02      1  2023
2   2023-01-03      1  2023
3   2023-01-04      1  2023
4   2023-01-05      1  2023
..         ...    ...   ...
360 2023-12-27     12  2023
361 2023-12-28     12  2023
362 2023-12-29     12  2023
363 2023-12-30     12  2023
364 2023-12-31     12  2023

[365 rows x 3 columns]

In [38]:
 df3.columns

Index(['date', 'month', 'year'], dtype='object')

In [39]:
df3[['month', 'year']].drop_duplicates()

     month  year
0        1  2023
31       2  2023
59       3  2023
90       4  2023
120      5  2023
151      6  2023
181      7  2023
212      8  2023
243      9  2023
273     10  2023
304     11  2023
334     12  2023

##### Q8. Write a Python program that takes in two dates as input (in the format YYYY-MM-DD) and calculates the difference between them in days, hours, and minutes using Pandas time delta. The program should prompt the user to enter the dates and display the result.

In [40]:
# Answer:

user_date_1  = str(input("Enter the date in the dd-mm-yy format : "))
user_date_2  = str(input("Enter the date in the dd-mm-yy format : "))

In [43]:
print(user_date_1)
print(user_date_2)

2023-03-14
2023-12-31

In [60]:
import datetime
data =[user_date_1,user_date_2]

In [61]:
data

['2023-03-14', '2023-12-31']

In [65]:
df_date = pd.DataFrame({"date":[user_date_1,user_date_2]})

In [66]:
df_date.dtypes

date    object
dtype: object

In [68]:
df_date['update_date'] = pd.to_datetime(df_date['date'])

In [69]:
df_date

         date update_date
0  2023-03-14  2023-03-14
1  2023-12-31  2023-12-31

In [70]:
df_date.dtypes

date                   object
update_date    datetime64[ns]
dtype: object

In [86]:
Difference = df_date.iloc[1,1]-df_date.iloc[0,1]
print("The difference between the two input date is:" ,Difference)

The difference between the two input date is: 292 days 00:00:00